## Week 11, Lab 1: SQL Practice

> Author: Matt Brems

In this lab, you're going to have ten prompts. Each prompt will require you to do two things:
1. Write a SQL query.
2. Use the result of that query to answer the question.

The purpose of this lab is to get you to practice your SQL - an **important** skill in data science! While it is possible to get these answers using Pandas, it should be your goal to do everything only in SQL.

**Data**: The data used in this lab is the famous (but fake) Northwind database. It contains various tables of transactions. The schema for the Northwind database can be found [here](http://www.zentut.com/wp-content/uploads/downloads/2013/06/Northwind-Sample-Database-Diagram.pdf).

In [1]:
import pandas as pd
from sqlalchemy import create_engine
engine = create_engine('postgres://jlpmxjkftcsepc:bb9cd75e6659d7d67ee3b86be0f905069319c75bd6823d786c808dd799ea85a2@ec2-54-227-251-33.compute-1.amazonaws.com:5432/d9teltkv30dni7')

### Prompt 1

How many rows are there in the `customers` table of the Northwind database?

In [6]:
# Use a SQL query to find the answer to the above prompt.

engine.dispose()

sql = """
SELECT COUNT(customers.customer_id)
FROM customers
"""

display(pd.read_sql_query(sql, engine))
engine.dispose()

   count
0     91

**Prompt 1 Answer**:

### Prompt 2

If you sort the customers in alphabetical order by name, which customer is fourth?

In [16]:
# Use a SQL query to find the answer to the above prompt.

engine.dispose()

sql = """
SELECT c.customer_id, c.company_name
FROM customers AS c
ORDER BY c.company_name
LIMIT 1 OFFSET 3
"""

display(pd.read_sql_query(sql, engine))
engine.dispose()

  customer_id     company_name
0       AROUT  Around the Horn

**Prompt 2 Answer**:

### Prompt 3

Among those customers who live in Germany, if you sort the customers in alphabetical order by name, which customer is fourth?

In [23]:
# Use a SQL query to find the answer to the above prompt.

engine.dispose()

sql = """
SELECT c.customer_id, c.company_name, c.country
FROM customers AS c
WHERE c.country = 'Germany'
ORDER BY c.company_name
LIMIT 1 OFFSET 3
"""

display(pd.read_sql_query(sql, engine))
engine.dispose()

  customer_id              company_name  country
0       DRACD  Drachenblut Delikatessen  Germany

**Prompt 3 Answer**:

### Prompt 4

From the `employees` table, what are the first names of the individuals who have a birthdate in the 1960s?

In [35]:
# Use a SQL query to find the answer to the above prompt.

engine.dispose()

sql = """
SELECT employees.first_name, employees.birth_date
FROM employees
where employees.birth_date >= '1960-01-01 00:00:00' 
       and employees.birth_date < '1961-01-01 00:00:00'
"""

display(pd.read_sql_query(sql, engine))
engine.dispose()

  first_name  birth_date
0     Robert  1960-05-29

**Prompt 4 Answer**:

### Prompt 5

In `order_details` table of the Northwind database, what is the total number of units sold for products 2, 3, and 4? 
> You should give us three numbers - one for each `ProductID`.

In [40]:
# Use a SQL query to find the answer to the above prompt.

engine.dispose()

sql = """
SELECT o.product_id, SUM(o.quantity) AS total_n_units  
FROM order_details AS o
WHERE o.product_id >= 2 AND o.product_id <= 4
GROUP BY o.product_id
"""

display(pd.read_sql_query(sql, engine))
engine.dispose()

   product_id  total_n_units
0           4            453
1           3            328
2           2           1057

**Prompt 5 Answer**:

### Prompt 6

From the `order_details` table of the Northwind database, calculate the revenue per product. In your SQL output, rename the revenue column `Revenue` and sort your results from largest revenue per product to smallest revenue per product. Which `ProductID` has the fifth-highest revenue, and what is that revenue rounded to the nearest dollar? 
> Note that revenue for a given product should be equal to the total unit price of that product times the quantity. You do not need to worry about the discount here. If you haven't multiplied columns together before, [this StackOverflow question](https://stackoverflow.com/questions/7536996/multiplying-two-columns-in-sql-server/7537059) may be helpful.

In [71]:
# Use a SQL query to find the answer to the above prompt.

engine.dispose()

sql = """
SELECT o.product_id, SUM(o.unit_price * o.quantity) AS Revenue
FROM order_details AS o
GROUP BY o.product_id
ORDER BY Revenue DESC
LIMIT 1 OFFSET 5
"""

display(pd.read_sql_query(sql, engine))
engine.dispose()
revenue = pd.read_sql_query(sql, engine)['revenue'][0]
product = pd.read_sql_query(sql, engine)['product_id'][0]
print(f'The Which ProductID has the fifth-highest revenue is {product}, and the revenue rounded to the nearest dollar is {round(revenue)} $')

   product_id       revenue
0          56  45121.199856

The Which ProductID has the fifth-highest revenue is 56, and the revenue rounded to the nearest dollar is 45121.0 $

**Prompt 6 Answer**:

### Prompt 7

From the `products` table of the Northwind database, show the `ProductName`, `UnitsInStock`, and `UnitsOnOrder` values for those products who have more units on order than units in stock. Among these results, which product has the most units on order?

In [76]:
# Use a SQL query to find the answer to the above prompt.

engine.dispose()

sql = """
SELECT p.product_name, p.units_in_stock, p.units_on_order
FROM products AS p
WHERE p.units_in_stock < p.units_on_order
ORDER BY units_on_order DESC
LIMIT 1
"""

display(pd.read_sql_query(sql, engine))
engine.dispose()

                product_name  units_in_stock  units_on_order
0  Louisiana Hot Spiced Okra               4             100

**Prompt 7 Answer**:

### Prompt 8

From the `order_details` table, show the products that have an average discount of at least 8%. Among these results, which average discount is closest to 8%?

In [85]:
# Use a SQL query to find the answer to the above prompt.

engine.dispose()

sql = """
SELECT o.product_id, AVG(o.discount) AS average_discount
FROM order_details AS o
GROUP BY o.product_id
HAVING AVG(o.discount) <= 0.08
ORDER BY average_discount DESC
LIMIT 1
"""

display(pd.read_sql_query(sql, engine))
engine.dispose()

   product_id  average_discount
0          18           0.07963

**Prompt 8 Answer**:

### Prompt 9

Return the `orders` table, but also include the first name, last name, and country of the employee assigned to each order. What is the first and last name of the employee assigned to `OrderID` 11077? (This is the last row in the data, provided that you do not sort.)

In [97]:
# Use a SQL query to find the answer to the above prompt.

engine.dispose()

sql = """
SELECT e.first_name, e.last_name, e.country, o.order_id
FROM employees AS e
INNER JOIN orders AS o ON e.employee_id = o.employee_id
WHERE o.order_id = 11077
"""

display(pd.read_sql_query(sql, engine))
engine.dispose()

  first_name last_name country  order_id
0      Nancy   Davolio     USA     11077

In [100]:
# Use a SQL query to find the answer to the above prompt.

engine.dispose()

sql = """
SELECT *
FROM employees
LIMIT 1
"""

display(pd.read_sql_query(sql, engine))
engine.dispose()

,employee_id,last_name,first_name,title,title_of_courtesy,birth_date,hire_date,address,city,region,postal_code,country,home_phone,extension,photo,notes,reports_to,photo_path
0,1,Davolio,Nancy,Sales Representative,Ms.,1948-12-08,1992-05-01,507 - 20th Ave. E.\nApt. 2A,Seattle,WA,98122,USA,(206) 555-9857,5467,[],Education includes a BA in psychology from Col...,2,http://accweb/emmployees/davolio.bmp

**Prompt 9 Answer**:

### Prompt 10

Find the average amount of freight across all orders, broken out by country of *employee*. (**NOT `ShipCountry`**.) How much higher is the average freight from UK employees than the average freight from US employees?

> For a bonus, round the freight to the nearest whole number and rename the column `Average Freight`.

In [108]:
# Use a SQL query to find the answer to the above prompt.

engine.dispose()

sql = """
SELECT AVG(o.freight), e.country
FROM orders AS o
INNER JOIN employees AS e
ON o.employee_id = e.employee_id
GROUP BY e.country
"""

display(pd.read_sql_query(sql, engine))
engine.dispose()
df = pd.read_sql_query(sql, engine)
diff = df['avg'][0] - df['avg'][1]
print(f'The difference between average freight from UK employees and US employees is {diff}')

         avg country
0  78.977143      UK
1  77.973284     USA

The difference between average freight from UK employees and US employees is 1.0038590845273063

**Prompt 10 Answer**: